bdbm_drv_new_version/run/fio/log/r_iops/1_fio_b1024-1.txt
fio1: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio1: Laying out IO file(s) (1 file(s) / 1000MiB)

fio1: (groupid=0, jobs=1): err= 0: pid=6416: Sun Mar 12 22:08:22 2017
  write: IOPS=5933, BW=23.2MiB/s (24.4MB/s)(1000MiB/43145msec)
    slat (usec): min=3, max=2502.4k, avg=166.97, stdev=6774.77
    clat (usec): min=1, max=2531.2k, avg=21318.15, stdev=76411.68
     lat (usec): min=19, max=2531.5k, avg=21485.12, stdev=76713.40
    clat percentiles (usec):
     |  1.00th=[ 1384],  5.00th=[ 4576], 10.00th=[ 7520], 20.00th=[15552],
     | 30.00th=[18304], 40.00th=[19840], 50.00th=[20864], 60.00th=[21632],
     | 70.00th=[22656], 80.00th=[23424], 90.00th=[24704], 95.00th=[25728],
     | 99.00th=[29056], 99.50th=[30336], 99.90th=[40704], 99.95th=[2342912],
     | 99.99th=[2539520]
    lat (usec) : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (usec) : 750=0.49%, 1000=0.12%
    lat (msec) : 2=0.87%, 4=2.47%, 10=9.14%, 20=28.55%, 50=58.26%
    lat (msec) : >=2000=0.10%
  cpu          : usr=0.60%, sys=7.32%, ctx=217411, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=23.2MiB/s (24.4MB/s), 23.2MiB/s-23.2MiB/s (24.4MB/s-24.4MB/s), io=1000MiB (1049MB), run=43145-43145msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%