bdbm_drv_new_version/run/fio/log/r_iops/2_fio_b1024-1.txt
fio2: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio2: Laying out IO file(s) (1 file(s) / 1000MiB)

fio2: (groupid=0, jobs=1): err= 0: pid=6405: Sun Mar 12 22:07:54 2017
  write: IOPS=12.5k, BW=48.8MiB/s (51.2MB/s)(1000MiB/20507msec)
    slat (usec): min=3, max=2502.4k, avg=79.39, stdev=7562.79
    clat (usec): min=1, max=2531.2k, avg=10173.36, stdev=85856.33
     lat (usec): min=18, max=2531.5k, avg=10252.75, stdev=86198.61
    clat percentiles (usec):
     |  1.00th=[  506],  5.00th=[  628], 10.00th=[  692], 20.00th=[  892],
     | 30.00th=[ 1448], 40.00th=[ 2320], 50.00th=[ 3536], 60.00th=[ 4896],
     | 70.00th=[ 6816], 80.00th=[15296], 90.00th=[20864], 95.00th=[23424],
     | 99.00th=[28032], 99.50th=[30080], 99.90th=[1728512], 99.95th=[2342912],
     | 99.99th=[2539520]
    lat (usec) : 2=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.38%
    lat (usec) : 750=13.20%, 1000=10.02%
    lat (msec) : 2=13.83%, 4=15.84%, 10=23.38%, 20=10.98%, 50=12.22%
    lat (msec) : 2000=0.05%, >=2000=0.10%
  cpu          : usr=0.94%, sys=12.76%, ctx=94513, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=48.8MiB/s (51.2MB/s), 48.8MiB/s-48.8MiB/s (51.2MB/s-51.2MB/s), io=1000MiB (1049MB), run=20507-20507msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%