bdbm_drv_new_version/run/fio/log/r_iops/3_fio_b1024-2.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=8993: Sun Mar 12 22:10:25 2017
  write: IOPS=6331, BW=24.8MiB/s (25.1MB/s)(1000MiB/40433msec)
    slat (usec): min=3, max=8703, avg=157.03, stdev=519.82
    clat (usec): min=1, max=36438, avg=20048.26, stdev=5660.65
     lat (usec): min=8, max=36457, avg=20205.30, stdev=5699.51
    clat percentiles (usec):
     |  1.00th=[ 1128],  5.00th=[ 1576], 10.00th=[14784], 20.00th=[18304],
     | 30.00th=[19840], 40.00th=[20608], 50.00th=[21376], 60.00th=[22144],
     | 70.00th=[22912], 80.00th=[23424], 90.00th=[24704], 95.00th=[25472],
     | 99.00th=[27520], 99.50th=[28288], 99.90th=[32128], 99.95th=[33024],
     | 99.99th=[35584]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.14%
    lat (msec) : 2=4.94%, 4=0.65%, 10=1.12%, 20=25.08%, 50=68.05%
  cpu          : usr=0.69%, sys=7.31%, ctx=213752, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=24.8MiB/s (25.1MB/s), 24.8MiB/s-24.8MiB/s (25.1MB/s-25.1MB/s), io=1000MiB (1049MB), run=40433-40433msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%