bdbm_drv_new_version/run/fio/log/r_iops/3_fio_b512-1.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=11639: Sun Mar 12 22:12:40 2017
  write: IOPS=7300, BW=28.6MiB/s (29.1MB/s)(1000MiB/35064msec)
    slat (usec): min=3, max=1353.5k, avg=136.08, stdev=3739.17
    clat (usec): min=1, max=1390.2k, avg=17392.04, stdev=42401.78
     lat (usec): min=26, max=1390.9k, avg=17528.13, stdev=42570.23
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    9], 10.00th=[   12], 20.00th=[   15],
     | 30.00th=[   16], 40.00th=[   16], 50.00th=[   17], 60.00th=[   17],
     | 70.00th=[   18], 80.00th=[   18], 90.00th=[   20], 95.00th=[   24],
     | 99.00th=[   33], 99.50th=[   35], 99.90th=[   40], 99.95th=[ 1336],
     | 99.99th=[ 1385]
    lat (usec) : 2=0.01%, 50=0.01%, 750=0.21%, 1000=0.28%
    lat (msec) : 2=0.44%, 4=0.63%, 10=6.01%, 20=84.37%, 50=7.95%
    lat (msec) : 2000=0.10%
  cpu          : usr=0.90%, sys=8.31%, ctx=233604, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=28.6MiB/s (29.1MB/s), 28.6MiB/s-28.6MiB/s (29.1MB/s-29.1MB/s), io=1000MiB (1049MB), run=35064-35064msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%