bdbm_drv_new_version/run/fio/log/r_iops/4_fsy_b2048-1.txt
fio0: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio0: Laying out IO file(s) (1 file(s) / 1000MiB)

fio0: (groupid=0, jobs=1): err= 0: pid=3063: Sun Mar 12 22:03:16 2017
  write: IOPS=2384, BW=9538KiB/s (9767kB/s)(1000MiB/107355msec)
    slat (usec): min=3, max=15595, avg= 7.61, stdev=77.41
    clat (usec): min=1, max=89594, avg=53256.17, stdev=5791.20
     lat (usec): min=5, max=89638, avg=53263.78, stdev=5794.07
    clat percentiles (usec):
     |  1.00th=[44288],  5.00th=[44288], 10.00th=[44800], 20.00th=[47872],
     | 30.00th=[48384], 40.00th=[48896], 50.00th=[54528], 60.00th=[57600],
     | 70.00th=[58624], 80.00th=[59136], 90.00th=[59136], 95.00th=[59648],
     | 99.00th=[61696], 99.50th=[64768], 99.90th=[75264], 99.95th=[79360],
     | 99.99th=[85504]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.02%, 50=41.46%, 100=58.50%
  cpu          : usr=0.20%, sys=99.21%, ctx=895, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=9538KiB/s (9767kB/s), 9538KiB/s-9538KiB/s (9767kB/s-9767kB/s), io=1000MiB (1049MB), run=107355-107355msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%